src/mp_toir/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФотоФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоФайлДвоичный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/СтруктураПредприятия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбрать изменения
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятияИзменения.Ссылка.Ссылка КАК Ссылка,
		|	СтруктураПредприятияИзменения.Ссылка.ФотоФайл КАК ФотоФайл,
		|	СтруктураПредприятияИзменения.Ссылка.ФотоФайлДвоичный КАК ФотоФайлДвоичный
		|ИЗ
		|	Справочник.СтруктураПредприятия.Изменения КАК СтруктураПредприятияИзменения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
